
======
Arrays
======

{ }
{ 42 }
{ 1 2 }
{ "key" 2 }

---

(source_file
	(collection (array))
	(collection (array (number (integer (base10)))))
	(collection (array (number (integer (base10))) (number (integer (base10)))))
	(collection (array (string) (number (integer (base10)))))
)

===============
Complex Numbers
===============

C{ 1/2 1/3 }
C{ 0 1 }

---

(source_file
	(collection (complex (number (ratio)) (number (ratio))))
	(collection (complex (number (integer (base10))) (number (integer (base10)))))
)

===========
Byte Arrays
===========

B{ }
B{ 1 2 3 }

---

(source_file
	(collection (byte_array))
	(collection (byte_array
		(integer (base10))
		(integer (base10))
		(integer (base10))
	))
)

=======
Vectors
=======

V{ }
V{ "some" "stuff" "here" 42+1/2 }

---

(source_file
	(collection (vector))
	(collection (vector (string) (string) (string) (number (ratio))))
)
